import fdb
import os

fdb_file_dir = 'C:/Users/Daulet/PycharmProjects/AkimBaza'
fdb_file_name = 'P1-Aksai-v2.FDB'
fdb_file_path = os.path.join(fdb_file_dir, fdb_file_name)


def parse_iins(idiins) -> list:
    id_iin_list = idiins.replace('\n', '').split(';')
    id_iin_list = map(lambda x: x.strip(), id_iin_list)
    id_iin_list = list(filter(lambda x: x != '', id_iin_list))

    people = []
    for id_iin in id_iin_list:
        id, iin = id_iin.split(', ')
        people.append({'id': id, 'iin': iin})

    return people


def from_ten_to_sixteen() -> None:
    """
    Список (ID, ИИН) домашних хозяйств, где возраст от 10 до 16 лет !:
    1) Уровень образования = 2 (начальное), 3 (основное среднее);
    2) Обучающийся в организациях образования = 2 (общеобразовательная школа);
    3) Положение в занятости = пусто;
    4) Источник средств к существованию = 9 (иждивенец);
    :return:
    """
    IDIINS = '''17731, 080430553313; 17938, 080225652347; 18034, 080209553301; 18109, 
080517651772; 18191, 080129553971; 18204, 080126653505; 18293, 080130652866; 
18441, 080118600085; 18609, 080426551954; 18721, 080526652185; 18808, 
080419652587; 19033, 080603651899; 19416, 080625552701; 19472, 080601694016; 
19582, 080628553974; 19872, 080520551900; 20457, 080523652337; 20829, 
080626552945; 21249, 080131553999; 21322, 080115500092; 21368, 080430552761; 
21432, 080527652253; 21562, 080310552293; 21607, 080126551047; 21720, 
080113600038; 22403, 080603554153; 22422, 080418552835; 22436, 080142555071; 
22471, 080225552380; 22503, 080526652809; 22578, 080115553638; 22901, 
080505651360; 22996, 080130654139; 22996, 080130654829; 23008, 080222552502;'''
    people = parse_iins(IDIINS)
    pred = [
        {'suodh_id': 2, 'sooo_id': 2, 'pz_id': None, 'sid_id': 9},
        {'suodh_id': 3, 'sooo_id': 2, 'pz_id': None, 'sid_id': 9}
    ]

    for person in people:
        update_sql = f"update kpu_srn set suodh_id=3, sooo_id=2, pz_id=null, sid_id=9 where iin='{person['iin']}'"
        cur.execute(update_sql)


def from_sixteen_to_seventeen() -> None:
    """
    Список (ID, ИИН) домашних хозяйств, где возраст от 16 до 17 !:
    1) Уровень образования = 3, 5 или 6;
    2) Обучающийся в организациях образования = пусто или 2, 3, 4;
    3) Обучающийся в организациях образования = 3 или 4,  тогда положение в занятости = 8, источник средств к существованию = 4, 7, 9 или 10;
    4) Положение в занятости = обязательное;
    5) Источник средств к существованию = обязательное;
    :return:
    """
    IDIINS = '''17525, 020525500937; 17546, 020322601478; 17573, 
020122500288; 18191, 020316500311; 18389, 020120600530; 18862, 020619501347; 
19053, 020220500270; 19123, 020129500187; 19182, 020501500119; 19193, 
020103500905; 19362, 020319600087; 19362, 040629500129; 19430, 020127500166; 
19718, 020109500702; 19892, 020306500248; 19998, 020402500160; 20033, 
020319600463; 20131, 020430600158; 20685, 020201500504; 20901, 020314500340; 
21301, 020418600243; 21311, 020110501364; 21380, 020531500479; 21549, 
020306500199; 21621, 020603500679; 21868, 020429600342; 22080, 020115600581; 
22960, 020518500499; 23008, 020221300256; 23087, 020211600466; 23194, 
020212600356;'''
    people = parse_iins(IDIINS)
    print(f'Количество: {len(people)}')

    for person in people:
        update_sql = f"update kpu_srn set suodh_id=3, sooo_id=2, pz_id=8, sid_id=9 where iin='{person['iin']}'"
        cur.execute(update_sql)


if __name__ == '__main__':
    print(fdb_file_path)
    con = fdb.connect(dsn=fdb_file_path, user='sysdba', password='masterkey')
    cur = con.cursor()
    # from_ten_to_sixteen()
    from_sixteen_to_seventeen()
    con.commit()
    con.close()